{
  "software_architect": "\nDear Hiring Manager,\n\nI am writing to express my strong interest in the {position} position at {company}. With 15+ years of experience designing and implementing enterprise-scale systems, I am excited about the opportunity to contribute to your technical architecture and drive innovation.\n\nIn my current role as AI/ML Engineer at Athlete Management Technologies, I have architected and implemented enterprise-scale ML pipelines processing 10TB+ of sensor data daily, serving 10,000+ athletes with 99.9% uptime. My expertise in microservices architecture, real-time data processing, and cloud infrastructure aligns perfectly with your requirements.\n\nKey highlights of my experience:\n• Architected 15+ enterprise-scale healthcare systems serving 5,000+ clients\n• Designed microservices architecture improving scalability by 300%\n• Led technical migration from legacy systems to modern architecture\n• Implemented real-time data processing pipelines reducing latency by 90%\n\nI am particularly drawn to {company} because of your commitment to {company_focus}. I would welcome the opportunity to discuss how my technical expertise and architectural vision can contribute to your team's success.\n\nThank you for your consideration.\n\nBest regards,\nAmin Parva\n        ",
  "data_engineer": "\nDear Hiring Manager,\n\nI am excited to apply for the {position} position at {company}. As a Senior Software Architect and AI/Data Engineer with extensive experience in data processing, machine learning, and pattern recognition, I am confident I can make significant contributions to your data engineering initiatives.\n\nCurrently, I specialize in athlete performance analytics and predictive modeling, where I have developed advanced data trimming algorithms and pattern recognition models using Python, TensorFlow, and scikit-learn, improving data quality by 95%. My experience with real-time data processing using Apache Kafka and Spark, combined with my expertise in cloud platforms like AWS SageMaker, makes me an ideal fit for this role.\n\nKey technical achievements:\n• Processed 10TB+ daily sensor data with 99.9% uptime\n• Developed ML pipelines serving 10,000+ athletes\n• Implemented automated feature engineering with 200+ features\n• Built scalable data architecture handling 50M+ data points daily\n\nI am particularly interested in {company} because of your focus on {company_focus}. I would love to discuss how my data engineering expertise can help drive your data initiatives forward.\n\nThank you for considering my application.\n\nBest regards,\nAmin Parva\n        "
}